import 'package:flutter/cupertino.dart';

class SuchanaModel {
  final String title;
  final String postBy;
  final String description;
  final Color bgColor;
  final List<String> pdfFiles;
  final String date;
  SuchanaModel({
    this.title,
    this.postBy,
    this.description,
    this.bgColor,
    this.pdfFiles,
    this.date,
  });
}

List<SuchanaModel> suchanas = [
  SuchanaModel(
      title: "सूचना को नाम",
      postBy: "Rajan Karki",
      description:
          "तपाईको फारम बुझाइएको छैन किनकि केहि गल्तीका कार सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्नवश्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ",
      bgColor: Color(0xFFD8D6FD),
      date: "३० माघ २०७७, शुक्रवार",
      pdfFiles: null),
  SuchanaModel(
      title: "सूचना को नाम",
      postBy: "Rajan Karki",
      description:
          "तपाईको फारम बुझाइएको छैन किनकि केहि गल्तीका कार सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्नवश्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ",
      bgColor: Color(0xFFFCD3C3),
      date: "३० माघ २०७७, शुक्रवार",
      pdfFiles: null),
  SuchanaModel(
      title: "सूचना को नाम",
      postBy: "Rajan Karki",
      description:
          "तपाईको फारम बुझाइएको छैन किनकि केहि गल्तीका कार सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्नवश्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ",
      bgColor: Color(0xFFC6F2E8),
      date: "३० माघ २०७७, शुक्रवार",
      pdfFiles: null),
  SuchanaModel(
      title: "सूचना को नाम",
      postBy: "Rajan Karki",
      description:
          "तपाईको फारम बुझाइएको छैन किनकि केहि गल्तीका कार सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्नवश्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ",
      bgColor: Color(0xFFFCEFC1),
      date: "३० माघ २०७७, शुक्रवार",
      pdfFiles: null),
  SuchanaModel(
      title: "सूचना को नाम",
      postBy: "Rajan Karki",
      description:
          "तपाईको फारम बुझाइएको छैन किनकि केहि गल्तीका कार सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्नवश्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न वश्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ सबै ढाँचा प्रयोग सिफा गर्न श्यक छ",
      bgColor: Color(0xFFD8D6FD),
      date: "३० माघ २०७७, शुक्रवार",
      pdfFiles: null),
];
